{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"latent_vector:0": {"name": "latent_vector:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"module_apply_default/clip_by_value_1:0": {"name": "module_apply_default/clip_by_value_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "module_apply_default/LeakyRelu_11/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_10/alpha", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/LeakyRelu_9/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_8/alpha", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/LeakyRelu_7/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_6/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_5/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_4/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_3/alpha", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/LeakyRelu_2/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_1/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu/alpha", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "latent_vector", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "module_apply_default/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "module_apply_default/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_0/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_1/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_0/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_2/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module_apply_default/BatchToSpaceND/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D_2/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_1/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_3/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_7/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/Conv2D_3/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_1/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_4/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_9/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "module_apply_default/Tile_1/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_1/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module_apply_default/BatchToSpaceND_1/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D_4/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_2/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_5/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_11/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_5/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_2/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_6/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_13/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_2/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_2/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_2/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D_6/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_3/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_7/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_15/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_7/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_3/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_8/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_17/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_3/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_3/block_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "module_apply_default/BatchToSpaceND_3/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D_8/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "256"}]}}}}}, {"name": "module/g_model/res_4/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_9/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_19/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_9/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_4/conv1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "module_apply_default/Mean_10/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_21/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_4/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_4/block_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_4/crops", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/Conv2D_10/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_5/conv0/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_11/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_23/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_11/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module/g_model/res_5/conv1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "module_apply_default/Mean_12/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "module_apply_default/add_25/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Conv2D_12/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "module_apply_default/clip_by_value_1/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/clip_by_value_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square", "op": "Square", "input": ["latent_vector"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean", "op": "Mean", "input": ["module_apply_default/Square", "module_apply_default/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_1", "op": "Add", "input": ["module_apply_default/Mean", "module_apply_default/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt", "op": "Rsqrt", "input": ["module_apply_default/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul", "op": "Mul", "input": ["latent_vector", "module_apply_default/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Reshape", "op": "Reshape", "input": ["module_apply_default/mul", "module_apply_default/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Pad", "op": "Pad", "input": ["module_apply_default/Reshape", "module_apply_default/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_1", "op": "Conv2D", "input": ["module_apply_default/Pad", "module_apply_default/Conv2D/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "module_apply_default/add_2", "op": "Add", "input": ["module_apply_default/mul_1", "module/g_model/res_0/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu/alpha", "module_apply_default/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu/mul", "module_apply_default/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_1", "op": "Square", "input": ["module_apply_default/LeakyRelu/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_1", "op": "Mean", "input": ["module_apply_default/Square_1", "module_apply_default/Mean_1/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_3", "op": "Add", "input": ["module_apply_default/Mean_1", "module_apply_default/add_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_1", "op": "Rsqrt", "input": ["module_apply_default/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_2", "op": "Mul", "input": ["module_apply_default/LeakyRelu/Maximum", "module_apply_default/Rsqrt_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_3", "op": "Conv2D", "input": ["module_apply_default/mul_2", "module_apply_default/Conv2D_1/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_4", "op": "Add", "input": ["module_apply_default/mul_3", "module/g_model/res_0/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_1/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_1/alpha", "module_apply_default/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_1/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_1/mul", "module_apply_default/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_2", "op": "Square", "input": ["module_apply_default/LeakyRelu_1/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_2", "op": "Mean", "input": ["module_apply_default/Square_2", "module_apply_default/Mean_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_5", "op": "Add", "input": ["module_apply_default/Mean_2", "module_apply_default/add_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_2", "op": "Rsqrt", "input": ["module_apply_default/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_4", "op": "Mul", "input": ["module_apply_default/LeakyRelu_1/Maximum", "module_apply_default/Rsqrt_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile", "op": "Tile", "input": ["module_apply_default/mul_4", "module_apply_default/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["module_apply_default/Tile", "module_apply_default/BatchToSpaceND/block_shape", "module_apply_default/BatchToSpaceND/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_5", "op": "Conv2D", "input": ["module_apply_default/BatchToSpaceND", "module_apply_default/Conv2D_2/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_6", "op": "Add", "input": ["module_apply_default/mul_5", "module/g_model/res_1/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_2/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_2/alpha", "module_apply_default/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_2/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_2/mul", "module_apply_default/add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_3", "op": "Square", "input": ["module_apply_default/LeakyRelu_2/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_3", "op": "Mean", "input": ["module_apply_default/Square_3", "module_apply_default/Mean_3/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_7", "op": "Add", "input": ["module_apply_default/Mean_3", "module_apply_default/add_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_3", "op": "Rsqrt", "input": ["module_apply_default/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_6", "op": "Mul", "input": ["module_apply_default/LeakyRelu_2/Maximum", "module_apply_default/Rsqrt_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_7", "op": "Conv2D", "input": ["module_apply_default/mul_6", "module_apply_default/Conv2D_3/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_8", "op": "Add", "input": ["module_apply_default/mul_7", "module/g_model/res_1/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_3/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_3/alpha", "module_apply_default/add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_3/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_3/mul", "module_apply_default/add_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_4", "op": "Square", "input": ["module_apply_default/LeakyRelu_3/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_4", "op": "Mean", "input": ["module_apply_default/Square_4", "module_apply_default/Mean_4/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_9", "op": "Add", "input": ["module_apply_default/Mean_4", "module_apply_default/add_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_4", "op": "Rsqrt", "input": ["module_apply_default/add_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_8", "op": "Mul", "input": ["module_apply_default/LeakyRelu_3/Maximum", "module_apply_default/Rsqrt_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_1", "op": "Tile", "input": ["module_apply_default/mul_8", "module_apply_default/Tile_1/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/BatchToSpaceND_1", "op": "BatchToSpaceND", "input": ["module_apply_default/Tile_1", "module_apply_default/BatchToSpaceND_1/block_shape", "module_apply_default/BatchToSpaceND_1/crops"], "attr": {"Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_9", "op": "Conv2D", "input": ["module_apply_default/BatchToSpaceND_1", "module_apply_default/Conv2D_4/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_10", "op": "Add", "input": ["module_apply_default/mul_9", "module/g_model/res_2/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_4/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_4/alpha", "module_apply_default/add_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_4/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_4/mul", "module_apply_default/add_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_5", "op": "Square", "input": ["module_apply_default/LeakyRelu_4/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_5", "op": "Mean", "input": ["module_apply_default/Square_5", "module_apply_default/Mean_5/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_11", "op": "Add", "input": ["module_apply_default/Mean_5", "module_apply_default/add_11/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_5", "op": "Rsqrt", "input": ["module_apply_default/add_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_10", "op": "Mul", "input": ["module_apply_default/LeakyRelu_4/Maximum", "module_apply_default/Rsqrt_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_11", "op": "Conv2D", "input": ["module_apply_default/mul_10", "module_apply_default/Conv2D_5/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_12", "op": "Add", "input": ["module_apply_default/mul_11", "module/g_model/res_2/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_5/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_5/alpha", "module_apply_default/add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_5/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_5/mul", "module_apply_default/add_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_6", "op": "Square", "input": ["module_apply_default/LeakyRelu_5/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_6", "op": "Mean", "input": ["module_apply_default/Square_6", "module_apply_default/Mean_6/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_13", "op": "Add", "input": ["module_apply_default/Mean_6", "module_apply_default/add_13/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_6", "op": "Rsqrt", "input": ["module_apply_default/add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_12", "op": "Mul", "input": ["module_apply_default/LeakyRelu_5/Maximum", "module_apply_default/Rsqrt_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_2", "op": "Tile", "input": ["module_apply_default/mul_12", "module_apply_default/Tile_2/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/BatchToSpaceND_2", "op": "BatchToSpaceND", "input": ["module_apply_default/Tile_2", "module_apply_default/BatchToSpaceND_2/block_shape", "module_apply_default/BatchToSpaceND_2/crops"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_13", "op": "Conv2D", "input": ["module_apply_default/BatchToSpaceND_2", "module_apply_default/Conv2D_6/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_14", "op": "Add", "input": ["module_apply_default/mul_13", "module/g_model/res_3/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_6/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_6/alpha", "module_apply_default/add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_6/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_6/mul", "module_apply_default/add_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_7", "op": "Square", "input": ["module_apply_default/LeakyRelu_6/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_7", "op": "Mean", "input": ["module_apply_default/Square_7", "module_apply_default/Mean_7/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_15", "op": "Add", "input": ["module_apply_default/Mean_7", "module_apply_default/add_15/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_7", "op": "Rsqrt", "input": ["module_apply_default/add_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_14", "op": "Mul", "input": ["module_apply_default/LeakyRelu_6/Maximum", "module_apply_default/Rsqrt_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_15", "op": "Conv2D", "input": ["module_apply_default/mul_14", "module_apply_default/Conv2D_7/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_16", "op": "Add", "input": ["module_apply_default/mul_15", "module/g_model/res_3/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_7/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_7/alpha", "module_apply_default/add_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_7/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_7/mul", "module_apply_default/add_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_8", "op": "Square", "input": ["module_apply_default/LeakyRelu_7/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_8", "op": "Mean", "input": ["module_apply_default/Square_8", "module_apply_default/Mean_8/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_17", "op": "Add", "input": ["module_apply_default/Mean_8", "module_apply_default/add_17/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_8", "op": "Rsqrt", "input": ["module_apply_default/add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_16", "op": "Mul", "input": ["module_apply_default/LeakyRelu_7/Maximum", "module_apply_default/Rsqrt_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_3", "op": "Tile", "input": ["module_apply_default/mul_16", "module_apply_default/Tile_3/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "module_apply_default/BatchToSpaceND_3", "op": "BatchToSpaceND", "input": ["module_apply_default/Tile_3", "module_apply_default/BatchToSpaceND_3/block_shape", "module_apply_default/BatchToSpaceND_3/crops"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_17", "op": "Conv2D", "input": ["module_apply_default/BatchToSpaceND_3", "module_apply_default/Conv2D_8/merged_input"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "module_apply_default/add_18", "op": "Add", "input": ["module_apply_default/mul_17", "module/g_model/res_4/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_8/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_8/alpha", "module_apply_default/add_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_8/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_8/mul", "module_apply_default/add_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_9", "op": "Square", "input": ["module_apply_default/LeakyRelu_8/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_9", "op": "Mean", "input": ["module_apply_default/Square_9", "module_apply_default/Mean_9/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_19", "op": "Add", "input": ["module_apply_default/Mean_9", "module_apply_default/add_19/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_9", "op": "Rsqrt", "input": ["module_apply_default/add_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_18", "op": "Mul", "input": ["module_apply_default/LeakyRelu_8/Maximum", "module_apply_default/Rsqrt_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_19", "op": "Conv2D", "input": ["module_apply_default/mul_18", "module_apply_default/Conv2D_9/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_20", "op": "Add", "input": ["module_apply_default/mul_19", "module/g_model/res_4/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_9/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_9/alpha", "module_apply_default/add_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_9/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_9/mul", "module_apply_default/add_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_10", "op": "Square", "input": ["module_apply_default/LeakyRelu_9/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_10", "op": "Mean", "input": ["module_apply_default/Square_10", "module_apply_default/Mean_10/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_21", "op": "Add", "input": ["module_apply_default/Mean_10", "module_apply_default/add_21/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_10", "op": "Rsqrt", "input": ["module_apply_default/add_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_20", "op": "Mul", "input": ["module_apply_default/LeakyRelu_9/Maximum", "module_apply_default/Rsqrt_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Tile_4", "op": "Tile", "input": ["module_apply_default/mul_20", "module_apply_default/Tile_4/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/BatchToSpaceND_4", "op": "BatchToSpaceND", "input": ["module_apply_default/Tile_4", "module_apply_default/BatchToSpaceND_4/block_shape", "module_apply_default/BatchToSpaceND_4/crops"], "attr": {"T": {"type": "DT_FLOAT"}, "Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}}}, {"name": "module_apply_default/mul_21", "op": "Conv2D", "input": ["module_apply_default/BatchToSpaceND_4", "module_apply_default/Conv2D_10/merged_input"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "module_apply_default/add_22", "op": "Add", "input": ["module_apply_default/mul_21", "module/g_model/res_5/conv0/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_10/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_10/alpha", "module_apply_default/add_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_10/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_10/mul", "module_apply_default/add_22"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_11", "op": "Square", "input": ["module_apply_default/LeakyRelu_10/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_11", "op": "Mean", "input": ["module_apply_default/Square_11", "module_apply_default/Mean_11/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/add_23", "op": "Add", "input": ["module_apply_default/Mean_11", "module_apply_default/add_23/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_11", "op": "Rsqrt", "input": ["module_apply_default/add_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_22", "op": "Mul", "input": ["module_apply_default/LeakyRelu_10/Maximum", "module_apply_default/Rsqrt_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_23", "op": "Conv2D", "input": ["module_apply_default/mul_22", "module_apply_default/Conv2D_11/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_24", "op": "Add", "input": ["module_apply_default/mul_23", "module/g_model/res_5/conv1/bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_11/mul", "op": "Mul", "input": ["module_apply_default/LeakyRelu_11/alpha", "module_apply_default/add_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/LeakyRelu_11/Maximum", "op": "Maximum", "input": ["module_apply_default/LeakyRelu_11/mul", "module_apply_default/add_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Square_12", "op": "Square", "input": ["module_apply_default/LeakyRelu_11/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Mean_12", "op": "Mean", "input": ["module_apply_default/Square_12", "module_apply_default/Mean_12/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "module_apply_default/add_25", "op": "Add", "input": ["module_apply_default/Mean_12", "module_apply_default/add_25/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/Rsqrt_12", "op": "Rsqrt", "input": ["module_apply_default/add_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_24", "op": "Mul", "input": ["module_apply_default/LeakyRelu_11/Maximum", "module_apply_default/Rsqrt_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/mul_25", "op": "Conv2D", "input": ["module_apply_default/mul_24", "module_apply_default/Conv2D_12/merged_input"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "module_apply_default/add_27", "op": "Add", "input": ["module_apply_default/mul_25", "module_apply_default/add_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/clip_by_value_1/Minimum", "op": "Minimum", "input": ["module_apply_default/add_27", "module_apply_default/clip_by_value_1/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "module_apply_default/clip_by_value_1", "op": "Maximum", "input": ["module_apply_default/clip_by_value_1/Minimum", "module_apply_default/clip_by_value_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of22.bin", "group1-shard2of22.bin", "group1-shard3of22.bin", "group1-shard4of22.bin", "group1-shard5of22.bin", "group1-shard6of22.bin", "group1-shard7of22.bin", "group1-shard8of22.bin", "group1-shard9of22.bin", "group1-shard10of22.bin", "group1-shard11of22.bin", "group1-shard12of22.bin", "group1-shard13of22.bin", "group1-shard14of22.bin", "group1-shard15of22.bin", "group1-shard16of22.bin", "group1-shard17of22.bin", "group1-shard18of22.bin", "group1-shard19of22.bin", "group1-shard20of22.bin", "group1-shard21of22.bin", "group1-shard22of22.bin"], "weights": [{"name": "module_apply_default/LeakyRelu_11/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_10/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_9/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_8/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_7/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_6/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_5/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_4/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_3/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_2/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu_1/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/LeakyRelu/alpha", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_1/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "module_apply_default/Conv2D/merged_input", "shape": [4, 4, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_0/conv0/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_1/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_3/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Conv2D_1/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_0/conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_2/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_5/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Tile/multiples", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND/block_shape", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "module_apply_default/Conv2D_2/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_1/conv0/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_3/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_7/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Conv2D_3/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_1/conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_4/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_9/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Tile_1/multiples", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_1/block_shape", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_1/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "module_apply_default/Conv2D_4/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_2/conv0/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_5/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_11/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Conv2D_5/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_2/conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_6/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_13/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Tile_2/multiples", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_2/block_shape", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_2/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "module_apply_default/Conv2D_6/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_3/conv0/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_7/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_15/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Conv2D_7/merged_input", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "module/g_model/res_3/conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "module_apply_default/Mean_8/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "module_apply_default/add_17/y", "shape": [], "dtype": "float32"}, {"name": "module_apply_default/Tile_3/multiples", "shape": [4], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_3/block_shape", "shape": [2], "dtype": "int32"}, {"name": "module_apply_default/BatchToSpaceND_3/crops", "shape": [2, 2], "dtype": "int32"}, {"name": "module_apply_default/Conv2D_8/merged_input", "shape": [3, 3, 512, 256], "dtype": 