{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "batch_normalization_12/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_12/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_12/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_12/moving_variance", "shape": [1024]}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_13/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_13/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_13/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_13/moving_variance", "shape": [1024]}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_14/gamma", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_14/beta", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_14/moving_mean", "shape": [1024]}, {"dtype": "float32", "name": "batch_normalization_14/moving_variance", "shape": [1024]}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_15/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_15/moving_variance", "shape": [512]}], "paths": ["group4-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_16/gamma", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_16/beta", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_16/moving_mean", "shape": [512]}, {"dtype": "float32", "name": "batch_normalization_16/moving_variance", "shape": [512]}], "paths": ["group5-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_17/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_17/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_17/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_17/moving_variance", "shape": [256]}], "paths": ["group6-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_18/gamma", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_18/beta", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_18/moving_mean", "shape": [256]}, {"dtype": "float32", "name": "batch_normalization_18/moving_variance", "shape": [256]}], "paths": ["group7-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_19/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_19/moving_variance", "shape": [128]}], "paths": ["group8-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_20/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/beta", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_20/moving_variance", "shape": [128]}], "paths": ["group9-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_21/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_21/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_21/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_21/moving_variance", "shape": [64]}], "paths": ["group10-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "batch_normalization_22/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_22/beta", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_22/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_22/moving_variance", "shape": [64]}], "paths": ["group11-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_17/kernel", "shape": [3, 3, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_17/bias", "shape": [1024]}], "paths": ["group12-shard1of10", "group12-shard2of10", "group12-shard3of10", "group12-shard4of10", "group12-shard5of10", "group12-shard6of10", "group12-shard7of10", "group12-shard8of10", "group12-shard9of10", "group12-shard10of10"]}, {"weights": [{"dtype": "float32", "name": "conv2d_18/kernel", "shape": [3, 3, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_18/bias", "shape": [1024]}], "paths": ["group13-shard1of10", "group13-shard2of10", "group13-shard3of10", "group13-shard4of10", "group13-shard5of10", "group13-shard6of10", "group13-shard7of10", "group13-shard8of10", "group13-shard9of10", "group13-shard10of10"]}, {"weights": [{"dtype": "float32", "name": "conv2d_19/kernel", "shape": [3, 3, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_19/bias", "shape": [1024]}], "paths": ["group14-shard1of10", "group14-shard2of10", "group14-shard3of10", "group14-shard4of10", "group14-shard5of10", "group14-shard6of10", "group14-shard7of10", "group14-shard8of10", "group14-shard9of10", "group14-shard10of10"]}, {"weights": [{"dtype": "float32", "name": "conv2d_20/kernel", "shape": [3, 3, 1024, 512]}, {"dtype": "float32", "name": "conv2d_20/bias", "shape": [512]}], "paths": ["group15-shard1of5", "group15-shard2of5", "group15-shard3of5", "group15-shard4of5", "group15-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_21/kernel", "shape": [3, 3, 512, 512]}, {"dtype": "float32", "name": "conv2d_21/bias", "shape": [512]}], "paths": ["group16-shard1of3", "group16-shard2of3", "group16-shard3of3"]}, {"weights": [{"dtype": "float32", "name": "conv2d_22/kernel", "shape": [3, 3, 1024, 512]}, {"dtype": "float32", "name": "conv2d_22/bias", "shape": [512]}], "paths": ["group17-shard1of5", "group17-shard2of5", "group17-shard3of5", "group17-shard4of5", "group17-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_23/kernel", "shape": [3, 3, 512, 256]}, {"dtype": "float32", "name": "conv2d_23/bias", "shape": [256]}], "paths": ["group18-shard1of2", "group18-shard2of2"]}, {"weights": [{"dtype": "float32", "name": "conv2d_24/kernel", "shape": [3, 3, 256, 256]}, {"dtype": "float32", "name": "conv2d_24/bias", "shape": [256]}], "paths": ["group19-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_25/kernel", "shape": [3, 3, 512, 256]}, {"dtype": "float32", "name": "conv2d_25/bias", "shape": [256]}], "paths": ["group20-shard1of2", "group20-shard2of2"]}, {"weights": [{"dtype": "float32", "name": "conv2d_26/kernel", "shape": [3, 3, 256, 128]}, {"dtype": "float32", "name": "conv2d_26/bias", "shape": [128]}], "paths": ["group21-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_27/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_27/bias", "shape": [128]}], "paths": ["group22-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_28/kernel", "shape": [3, 3, 256, 128]}, {"dtype": "float32", "name": "conv2d_28/bias", "shape": [128]}], "paths": ["group23-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_29/kernel", "shape": [3, 3, 128, 64]}, {"dtype": "float32", "name": "conv2d_29/bias", "shape": [64]}], "paths": ["group24-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_30/kernel", "shape": [3, 3, 64, 64]}, {"dtype": "float32", "name": "conv2d_30/bias", "shape": [64]}], "paths": ["group25-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_31/kernel", "shape": [3, 3, 128, 64]}, {"dtype": "float32", "name": "conv2d_31/bias", "shape": [64]}], "paths": ["group26-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_32/kernel", "shape": [3, 3, 64, 3]}, {"dtype": "float32", "name": "conv2d_32/bias", "shape": [3]}], "paths": ["group27-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_11/kernel", "shape": [2, 2, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_transpose_11/bias", "shape": [1024]}], "paths": ["group28-shard1of5", "group28-shard2of5", "group28-shard3of5", "group28-shard4of5", "group28-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_12/kernel", "shape": [2, 2, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_transpose_12/bias", "shape": [1024]}], "paths": ["group29-shard1of5", "group29-shard2of5", "group29-shard3of5", "group29-shard4of5", "group29-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_13/kernel", "shape": [2, 2, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_transpose_13/bias", "shape": [1024]}], "paths": ["group30-shard1of5", "group30-shard2of5", "group30-shard3of5", "group30-shard4of5", "group30-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_14/kernel", "shape": [2, 2, 1024, 1024]}, {"dtype": "float32", "name": "conv2d_transpose_14/bias", "shape": [1024]}], "paths": ["group31-shard1of5", "group31-shard2of5", "group31-shard3of5", "group31-shard4of5", "group31-shard5of5"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_15/kernel", "shape": [2, 2, 512, 512]}, {"dtype": "float32", "name": "conv2d_transpose_15/bias", "shape": [512]}], "paths": ["group32-shard1of2", "group32-shard2of2"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_16/kernel", "shape": [2, 2, 512, 512]}, {"dtype": "float32", "name": "conv2d_transpose_16/bias", "shape": [512]}], "paths": ["group33-shard1of2", "group33-shard2of2"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_17/kernel", "shape": [2, 2, 256, 256]}, {"dtype": "float32", "name": "conv2d_transpose_17/bias", "shape": [256]}], "paths": ["group34-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_18/kernel", "shape": [2, 2, 256, 256]}, {"dtype": "float32", "name": "conv2d_transpose_18/bias", "shape": [256]}], "paths": ["group35-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_19/kernel", "shape": [2, 2, 128, 128]}, {"dtype": "float32", "name": "conv2d_transpose_19/bias", "shape": [128]}], "paths": ["group36-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "conv2d_transpose_20/kernel", "shape": [2, 2, 128, 128]}, {"dtype": "float32", "name": "conv2d_transpose_20/bias", "shape": [128]}], "paths": ["group37-shard1of1"]}, {"weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [128, 16384]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [16384]}], "paths": ["group38-shard1of3", "group38-shard2of3", "group38-shard3of3"]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 128], "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "batch_input_shape": [null, 128], "activity_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "name": "dense_2", "units": 16384, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [1024, 4, 4]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_12", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_transpose_11", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_11", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_17", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_11", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_13", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_transpose_12", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_12", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_18", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_19", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_12", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["conv2d_18", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_14", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_transpose_13", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_13", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 512, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_20", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_15", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_transpose_14", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 1024, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_14", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 512, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_21", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 512, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_22", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_14", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_16", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_transpose_15", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 512, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_15", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 256, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_23", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_15", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_17", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_transpose_16", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 512, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_16", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 256, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_24", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 256, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_25", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_16", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_18", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "conv2d_transpose_17", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 256, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_17", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 128, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_26", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_17", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_19", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_transpose_18", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 256, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_18", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 128, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_27", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 128, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_28", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_18", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_28", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_20", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "conv2d_transpose_19", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 128, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_19", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 64, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_29", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_21", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_transpose_20", "class_name": "Conv2DTranspose", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 128, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 2], "kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_transpose_20", "padding": "same", "use_bias": true, "strides": [2, 2], "kernel_regularizer": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 64, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_30", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 64, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_31", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["conv2d_transpose_20", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"trainable": true, "name": "add_10"}, "inbound_nodes": [[["conv2d_30", 0, 0, {}], ["conv2d_31", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_regularizer": null, "center": true, "name": "batch_normalization_22", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "epsilon": 0.001}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "filters": 3, "activation": "linear", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_32", "kernel_regularizer": null, "padding": "same", "use_bias": true, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "tanh"}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}], "name": "model_2", "output_layers": [["activation_24", 0, 0]]}}, "keras_version": "2.1.5"}}